package day05; // 패키지 선언 //////////////// 소중한 수업시간 많이 물어보자!!!!!!

public class Test50_접근지정자 { // 

	public static void main(String[] args) {
		
		/*
		  	public : 접근지정자
		  	class : 클래스(설계도) 만들겠다~~ 키워드
		  	Test50 : 클래스 이름, 첫글자 대문자로
		  	{} : 클래스의 영역. 메인()메서드를 가지고 있다.
		  	
		  	static : 전역 선언 키워드
		    void : 리턴타입이 없는 형태, 돌려줄 값이 없는 형태. 웹으로 전달해줄 데이터가 없어~
		    	메서드는 기능 수행하고 결과값을 알려달라고 하는 경우가 있음.
	    	main : 메서드의 이름. 프로그램 시작하면 가장 먼저 실행되는 특수 힘이 있다.
	    	(String[] args) : 소괄호 안에 있는 변수는 매개변수 . 해당 메서드 실행시 실행되는 변수?
	    	{} : 메인메서드 영역 
		 */
		
		//// if문은 ~~~를 하기 위해 검사하는 것이다.
		//if () {// if : if문 작성하는 키워드, 소괄호(조건식 또는 true/false){실행문}
		
	
	}

}

