package day01; // 속하는 패키지를 지정하는 명령어

public class Test01 { // 클래스 만드는 명령어 / 퍼블릭 넓게씀
	// 변수, 상수, 메서드 등을 넣을 수 있음
	/*
	 	클래스 명명 규칙 : 첫글자 대문자(관례, 특정 API에서 실행 안되는 경우도), 띄어쓰기 X, 특수기호 _ $ 만 사용가능,
	 				 숫자시작X, 대소문자 구분 O Num num은 다르다, 유일한 이름이어야
	 */

	public static void main(String[] args) { //키워드 보라색. 이름은 검정색 괄호가 바로 붙으면 메서드다. 
		// 한 파일 안에는 메인 하나여야, 메인은 클래스 안에 있어야 함
		// 코드 작성 영역 ; 메인메서드영역 - 프로그램 실행시 가장 먼저 실행됨  / 중괄호 열리면 들여쓰기 세트. 중괄호 닫는건 해당 영역과 줄을맞춰야함
  		System.out.println("hello");
		System.out.println("ciao!");
		// 주석 : 실행하지 않은 코드나 메모시 사용 - 단축키 : ctrl + /
		/*
		  여러줄 주석은
		*/
		// 실행 단축키 : ctrl + F11
		
	}

}
